---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.StairsPathType
source: html/2a68885e-c936-0d86-5616-3ae488eac35f.htm
---
# StairsPathType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.